#include "lotview.h"
#include "stdio.h"
#include <stdlib.h>

void V_game_move(int choose)
{
	system("clear");

        printf("        \033[44;30m----超级大乐透-中奖没商量----\033[0m\n\n");
        printf("-----------\033[5m===>三级界面   游戏<===\033[0m-----------\n");

        if(choose==1)
	printf("\033[47;31m1.剪刀石头布\033[0m\n");
	else
	printf("1.剪刀石头布\n");

	if(choose==2)
        printf("\033[47;31m2.贪吃蛇（未完成）\033[0m\n");
	else
	printf("2.贪吃蛇（未完成）\n");
	
	if(choose==3)
	printf("\033[47;31m3.坦克大战（未完成）\033[0m\n");
	else
        printf("3.坦克大战（未完成）\n");

	if(choose==0)
        printf("\033[47;31m0.返回上级\033[0m\n");
	else
	printf("0.返回上级\n");

        printf("\n\n---------------@游戏  操作指南@--------------\n");
        printf("\033[47;31m“   0~3  ” \033[0m 可直接选择栏目\n");
	printf("\033[47;31m“向上向下” \033[0m 可以改变选中项\n");
        printf("\033[47;31m“点击左键” \033[0m 用来退出系统\n");
        printf("\033[47;31m“右或回车” \033[0m 进入当前选择的栏目\n");
       
}

void V_sort_move(int choose)
{
	system("clear");
	printf("        \033[44;30m----超级大乐透-中奖没商量----\033[0m\n\n");
        printf("-----------\033[5m===>三级界面   排序<===\033[0m-----------\n");
	printf("正对用户信息的排序操作\n\n");
	if(choose==1)
	printf("\033[47;31m1.按姓名排序\033[0m\n");		//基本完成
	else
	printf("1.按姓名排序\n");		//基本完成

	if(choose==2)
	printf("\033[47;31m2.按 ID 排序\033[0m\n");		//基本完成
	else
	printf("2.按 ID 排序\n");		//基本完成

	if(choose==0)
	printf("\033[47;31m0.返回上级\033[0m\n");			
	else
	printf("0.返回上级\n");			

        printf("\n\n---------------@排序  操作指南@--------------\n");
        printf("\033[47;31m“   0~2  ” \033[0m 可直接选择栏目\n");
	printf("\033[47;31m“向上向下” \033[0m 可以改变选中项\n");
        printf("\033[47;31m“点击左键” \033[0m 用来退出系统\n");
        printf("\033[47;31m“右或回车” \033[0m 进入当前选择的栏目\n");
     
}

void V_main_menu_move(int choose)//界面_主菜单
{
	system("clear");


	printf("        \033[45;37m----超级大乐透-中奖没商量----\033[0m\n\n");
        printf("-----------\033[5m===>一级界面 主界面<===\033[0m-----------\n");
	if(choose==1)//-----------------------------------------------
	{	
        	printf("\033[47;31m1.用户登录\033[0m\n"); //基本完成
	}
	else
	{
		printf("1.用户登录\n"); //基本完成
	}

        if(choose==2)//-----------------------------------------------
        {
                printf("\033[47;31m2.用户注册\033[0m\n"); //基本完成
        }
        else
        {
        	printf("2.用户注册\n"); //基本完成
	}

        if(choose==3)//-----------------------------------------------
        {
                printf("\033[47;31m3.公证员登录\033[0m\n"); //基本完成
        }
        else
        {
        	printf("3.公证员登录\n");//基本完成
	}

        if(choose==4)//------------------------------------------------
        {
                printf("\033[47;31m4.管理员登录\033[0m\n"); //基本完成
        }
        else
        {
        	printf("4.管理员登录\n");//基本完成
	}
	if(choose==5)//------------------------------------------------
        {
                printf("\033[47;31m5.其他信息\033[0m\n"); //基本完成
        }
        else
        {
                printf("5.其他信息\n");//基本完成
        }
	
        if(choose==0)//-------------------------------------------------
        {
                printf("\033[47;31m0.退出系统\033[0m\n"); //基本完成
        }
        else
        {
        	printf("0.退出系统\n");
	}
	//主界面操作指南：
	printf("\n\n---------------@主界面操作指南@--------------\n");
	printf("\033[47;31m“向上向下” \033[0m 可以改变选中项\n");
	printf("\033[47;31m“点击左键” \033[0m 用来退出系统\n");
	printf("\033[47;31m“右或回车” \033[0m 进入当前选择的栏目\n");
	printf("\033[47;31m“   0~6  ” \033[0m 可直接选择栏目\n");
	printf("管理员admin,公证员notery\n");
	

}


void V_user_menu_move(int choose)
{
	system("clear");
	 printf("        \033[42;33m----超级大乐透-中奖没商量----\033[0m\n\n");
         printf("-----------\033[5m===>二级界面   用户<===\033[0m-----------\n");         

	if(choose==1)
	 printf("\033[47;31m1.查看个人信息\033[0m\n"); //基本完成
	else
	 printf("1.查看个人信息\n"); //基本完成
	if(choose==2)
 	 printf("\033[47;31m2.修改密码\033[0m\n");	   //基本完成 
	else
 	 printf("2.修改密码\n");	   //基本完成 
	if(choose==3)
	 printf("\033[47;31m3.账户充值\033[0m\n");	   //基本完成 
	else
	 printf("3.账户充值\n");	   //基本完成 
	if(choose==4)
	 printf("\033[47;31m4.购买彩票\033[0m\n");	   //基本完成	
	else
	 printf("4.购买彩票\n");	   //基本完成	
	if(choose==5)
	 printf("\033[47;31m5.查看历史记录\033[0m\n"); //基本完成
	else
	 printf("5.查看历史记录\n"); //基本完成
	if(choose==0)
	 printf("\033[47;31m0.注销登录\033[0m\n");
	else
	 printf("0.注销登录\n");
	
	printf("\n\n---------------@用户  操作指南@--------------\n");
        printf("\033[47;31m“   0~5  ” \033[0m 可直接选择栏目\n");
	printf("\033[47;31m“向上向下” \033[0m 可以改变选中项\n");
        printf("\033[47;31m“点击左键” \033[0m 用来退出系统\n");
        printf("\033[47;31m“右或回车” \033[0m 进入当前选择的栏目\n");
        
}

void V_other_move(int choose)
{
	system("clear");

        printf("        \033[42;33m----超级大乐透-中奖没商量----\033[0m\n\n");
        printf("-----------\033[5m===>二级界面   信息<===\033[0m-----------\n");
	if(choose==1)
        printf("\033[47;31m1.基本信息\033[0m\n");
	else
	printf("1.基本信息\n");

	if(choose==2)
        printf("\033[47;31m2.图标\033[0m\n");
	else
	printf("2.图标\n");

	if(choose==3)
        printf("\033[47;31m3.二维码\033[0m\n");
	else
	printf("3.二维码\n");

	if(choose==0)
        printf("\033[47;31m0.返回上级\033[0m\n");
	else
	printf("0.返回上级\n");

        printf("\n\n---------------@信息  操作指南@--------------\n");
        printf("\033[47;31m“   0~3  ” \033[0m 可直接选择栏目\n");
	printf("\033[47;31m“向上向下” \033[0m 可以改变选中项\n");
        printf("\033[47;31m“点击左键” \033[0m 用来退出系统\n");
        printf("\033[47;31m“右或回车” \033[0m 进入当前选择的栏目\n");
}
void V_notery_menu_move(int choose)
{
	system("clear");

         printf("        \033[42;33m----超级大乐透-中奖没商量----\033[0m\n\n");
         printf("-----------\033[5m===>二级界面 公证员<===\033[0m-----------\n");

	if(choose==1)
	 printf("\033[47;31m1.开奖\033[0m\n");    	//基本完成
	else
	 printf("1.开奖\n");    	//基本完成
	if(choose==2)
 	 printf("\033[47;31m2.查看历史发行记录\033[0m\n");//基本完成
	else
 	 printf("2.查看历史发行记录\n");//基本完成
	if(choose==3)
	 printf("\033[47;31m3.休闲游戏\033[0m\n");	//基本完成
	else
	 printf("3.休闲游戏\n");	//基本完成
	if(choose==0)
	 printf("\033[47;31m0.退出系统\033[0m\n");
	else
	 printf("0.退出系统\n");


         printf("\n\n---------------@公证员 操作指南@--------------\n");
         printf("\033[47;31m“   0~3  ” \033[0m 可直接选择栏目\n");
	printf("\033[47;31m“向上向下” \033[0m 可以改变选中项\n");
        printf("\033[47;31m“点击左键” \033[0m 用来退出系统\n");
        printf("\033[47;31m“右或回车” \033[0m 进入当前选择的栏目\n");
     
}

void V_admin_menu_move(int choose)
{
	 system("clear"); 

	 printf("        \033[42;33m----超级大乐透-中奖没商量----\033[0m\n\n");
         printf("-----------\033[5m===>二级界面 管理员<===\033[0m-----------\n");
	
	if(choose==1)
	 printf("\033[47;31m1.查看所有用户\033[0m\n");//基本实现
	else
	 printf("1.查看所有用户\n");//基本实现
	if(choose==2)
	 printf("\033[47;31m2.查找彩民\033[0m\n");    //查看用户，彩票信息
	else
	 printf("2.查找彩民\n");    //查看用户，彩票信息
	if(choose==3)
	 printf("\033[47;31m3.发行彩票\033[0m\n");    //基本完成
	else
	 printf("3.发行彩票\n");    //基本完成
	if(choose==4)
	 printf("\033[47;31m4.用户排序\033[0m\n");	    //完成
	else
	 printf("4.用户排序\n");	    //完成
	if(choose==5)
	 printf("\033[47;31m5.奖金发放\033[0m\n");    //基本完成	 
	else
	 printf("5.奖金发放\n");    //基本完成	 
	if(choose==6)
	 printf("\033[47;31m6.奖池管理\033[0m\n");    //基本完成
	else
	 printf("6.奖池管理\n");    //基本完成
	if(choose==7)
	 printf("\033[47;31m7.删除用户\033[0m\n");    //基本完成
	else
	 printf("7.删除用户\n");    //基本完成
	if(choose==8)
	 printf("\033[47;31m8.查看全部购买信息\033[0m\n");    //基本完成
	else
	 printf("8.查看全部购买信息\n");    //基本完成
	if(choose==0)
	 printf("\033[47;31m0.退出系统\033[0m\n");
	else
	 printf("0.退出系统\n");
         printf("\n\n---------------@管理员 操作指南@--------------\n");
         printf("\033[47;31m“   0~8  ” \033[0m 可直接选择栏目\n");
	printf("\033[47;31m“向上向下” \033[0m 可以改变选中项\n");
        printf("\033[47;31m“点击左键” \033[0m 用来退出系统\n");
        printf("\033[47;31m“右或回车” \033[0m 进入当前选择的栏目\n");
        
}


